title: Suspicious PowerShell Execution Patterns
id: 0fdd6acd-9878-40f7-8a82-af40c4a11a41
description: Detects PowerShell with encoding, Office spawning PowerShell, and evasion techniques observed in APT29 attacks. Detects suspicious parent processes launching PowerShell with network activity or evasion flags.
author: Manish Rawat
status: experimental
date: 2026-04-23
modified: 2026-05-02
references:
    - https://attack.mitre.org/techniques/T1059/001/
    - https://github.com/OTRF/Security-Datasets
    - https://github.com/Manishrawat21/Detection-Rules
    - https://manishrawat21.substack.com
logsource:
    product: windows
    category: process_creation
detection:
    selection:
        Image|endswith:
            - '\powershell.exe'
            - '\pwsh.exe'
    selection_Parameter:
        CommandLine|contains:
            - '-encoded'
            - '-enc' 
            - '-e ' 
            - '-EncodedCommand'
            - '-en' 
            - '-enco'
    selection_Process:
        ParentImage|endswith:
            - '\winword.exe'
            - '\excel.exe'
            - '\outlook.exe'
            - '\wscript.exe'
            - '\mshta.exe'
            - '\cmd.exe'
            - '\control.exe'
            - '\powershell.exe'
    selection_evasion:
        CommandLine|contains:
            - '-NoLogo'
            - '-NoProfile'
            - '-nopi'
            - '-nop'
            - '-noexit'
            - '-ep bypass'
            - '-window hidden'        
    selection_network:
        CommandLine|contains:
            - 'wget'
            - 'curl'
            - 'Invoke-WebRequest'
            - 'Net.WebClient'
            - 'DownloadString'
            - 'DownloadFile'
            - 'Start-Process'
    condition: selection and (selection_Parameter or (selection_Process and selection_network) or (selection_Process and selection_evasion))
falsepositives:
    - legitimate admin activity 
    - legitimate network activity
level: high
tags:
    - attack.t1027
    - attack.obfuscation
    - attack.t1059.001
    - attack.execution
fields:
    - CommandLine
    - ParentImage
    - ParentCommandLine
    - User
